tool/makefile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-22 Sat 20:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Makefile 笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Makefile 笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org52c8f44">1. Makefile</a></li>
<li><a href="#org5849fe0">2. 语法</a>
<ul>
<li><a href="#org79ae3d9">2.1. 基本语法</a></li>
<li><a href="#orgc1bfe44">2.2. 变量</a>
<ul>
<li><a href="#orgb3fb8c6">2.2.1. 读取文件名</a></li>
<li><a href="#org116b98f">2.2.2. 覆盖变量</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd955b69">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org52c8f44" class="outline-2">
<h2 id="org52c8f44"><span class="section-number-2">1</span> Makefile</h2>
<div class="outline-text-2" id="text-1">
<p>
Makefile 是 Linux 系统中的一个比较重要的工具，通常可以用来管理软件项目的编译，
连接等作用，但是功能不仅仅如此
</p>
</div>
</div>

<div id="outline-container-org5849fe0" class="outline-2">
<h2 id="org5849fe0"><span class="section-number-2">2</span> 语法</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org79ae3d9" class="outline-3">
<h3 id="org79ae3d9"><span class="section-number-3">2.1</span> 基本语法</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Makefile 的基本语法是由目标、依赖和命令组成，它的语法如下：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #b58900;">target</span>: dependencies
    command
</pre>
</div>

<ul class="org-ul">
<li>target 执行目标，当在命令行中敲 <code>make target</code> 执行相应的目标</li>
<li>dependencies 依赖项，通常是一个列表，中间使用空格分隔</li>
<li>command 执行目标使用的命令，注意的是 command 的前面 <b>只能是 tab 符号</b></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1bfe44" class="outline-3">
<h3 id="orgc1bfe44"><span class="section-number-3">2.2</span> 变量</h3>
<div class="outline-text-3" id="text-2-2">
<p>
变量定义的方法是使用一个等于号连接变量和如下：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c71c4;">VAR_NAME</span> = definition
</pre>
</div>
</div>

<div id="outline-container-orgb3fb8c6" class="outline-4">
<h4 id="orgb3fb8c6"><span class="section-number-4">2.2.1</span> 读取文件名</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c71c4;">SRCS</span> = $(<span style="color: #6c71c4;">shell</span> ls *.cc)
</pre>
</div>
</div>
</div>

<div id="outline-container-org116b98f" class="outline-4">
<h4 id="org116b98f"><span class="section-number-4">2.2.2</span> 覆盖变量</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
首先在 Makefile 中定义 TEST 变量
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c71c4;">TEST</span> = apple

<span style="color: #b58900;">all</span>:
    echo $(<span style="color: #6c71c4;">TEST</span>)
</pre>
</div>

<p>
在 make 命令后面可以使用 <code>VAR=value</code> 的方式可以覆盖 Makefile 里面的变量
</p>
<div class="org-src-container">
<pre class="src src-text">$ make all
echo apple
apple
$ make all TEST=banana
echo banana
banana
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd955b69" class="outline-2">
<h2 id="orgd955b69"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://www.gnu.org/software/make/manual/make.html">GNU make</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-02-22 Sat 20:09. Created by Jinghui Hu at 2019-08-05 Mon 20:47.</p>
</div>
</body>
</html>
